app/views/foods/posts.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 7]]
---
<div style="border: 1px solid #ffffff">
  <h4><a href="/foods/show/<%= post.id %>"><%= post.title %></a>[<%= post.comments.count %>]</h4>