app/views/foods/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 7]]
---
 <hr>
  <% @post.comments.each do |comment| %>