app/controllers/carts_controller.rb

  def index
    @carts = Cart.all
---
SELECT "carts".* FROM "carts"

  def show
    begin
     @cart = Cart.find(params[:id])
---
SELECT  "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @cart = Cart.new(cart_params)

    respond_to do |format|
      if @cart.save
---
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-06-02 11:31:08.529288"], ["updated_at", "2015-06-02 11:31:08.529288"]]

  def destroy
    @cart = current_cart
    @cart.destroy
---
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 1]]

    def set_cart
      @cart = Cart.find(params[:id])
---
SELECT  "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", 980190962]]