app/controllers/foods_controller.rb

SELECT "posts".* FROM "posts"
---
  def posts
      @posts = Post.all

SELECT "posts".* FROM "posts" WHERE "posts"."category" = ?  [["category", "보드카"]]
---
  def posts_category
    case params[:category]
    when "soju"
      @category = "소주"
    when "vodka"
      @category = "보드카"
    else
      @category = "와인"
   end
     @posts = Post.where(category: @category)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
     @post = Post.find(params[:id])
  @comment_writer = User.where(id: session[:user_id])[0]

INSERT INTO "posts" ("category", "title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["category", "보드카"], ["title", "그레이구스 구매 후기;;"], ["content", "생각보다 비싸고 맛이 없네요;\r\n별점 2개드립니다."], ["created_at", "2015-06-16 04:49:28.428420"], ["updated_at", "2015-06-16 04:49:28.428420"]]
---
  def write_complete
    post = Post.new
    post.user_id = session[:user_id]
    post.category = params[:post_category]
    post.title = params[:post_title]
    post.content = params[:post_content]
    if post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "posts" SET "category" = ?, "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["category", "후기"], ["content", "공지사항0 글sf"], ["updated_at", "2015-06-16 15:13:50.658415"], ["id", 6]]
---
  def edit_complete
    post = Post.find(params[:id])
    post.category = params[:post_category]
    post.title = params[:post_title]
    post.content = params[:post_content]
    if post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 6]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 6]]
---
  def delete_complete
    post = Post.find(params[:id])
    post.destroy

INSERT INTO "comments" ("user_id", "post_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["post_id", 1], ["content", "12344"], ["created_at", "2015-06-16 06:17:26.154001"], ["updated_at", "2015-06-16 06:17:26.154001"]]
---
  def write_comment_complete
    comment = Comment.new
    comment.user_id = session[:user_id]
    comment.post_id = params[:post_id]
    comment.content = params[:comment_content]
    comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]
---
  def delete_comment_complete
    comment = Comment.find(params[:id])
    comment.destroy