app/controllers/orders_controller.rb

SELECT  1 AS one FROM "line_items" WHERE "line_items"."cart_id" = ? LIMIT 1  [["cart_id", 10]]
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = ?  [["cart_id", 10]]
---
  def new
    if @cart.line_items.empty?

INSERT INTO "orders" ("name", "address", "email", "pay_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "dd"], ["address", "ddd"], ["email", "dd@aad.cc"], ["pay_type", "Check"], ["created_at", "2015-06-03 05:44:38.290883"], ["updated_at", "2015-06-03 05:44:38.290883"]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 10]]
---
  def create
    @order = Order.new(order_params)
    @order.add_line_items_from_cart(@cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])