app/controllers/users_controller.rb

  def signup_complete
 user = User.new
    user.username = params[:username]
    if params[:password] == params[:retype_password]
      user.password = params[:password]
      if user.save
---
INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "test1234"], ["password", "test1234"], ["created_at", "2015-06-16 05:52:06.498273"], ["updated_at", "2015-06-16 05:52:06.498273"]]

  def login_complete
    user = User.where(username: params[:username])[0]
---
SELECT "users".* FROM "users" WHERE "users"."username" = ?  [["username", "test1234"]]